function juzName(number) {
  // const arabicNumbers = [
  //   "الأَوَّلُ",
  //   "الثَّانِي",
  //   "الثَّالِثُ",
  //   "الرَّابِعُ",
  //   "الخَامِسُ",
  //   "السَّادِسُ",
  //   "السَّابِعُ",
  //   "الثَّامِنُ",
  //   "التَّاسِعُ",
  //   "العَاشِرُ",
  //   "الحَادِيَ عَشَرَ",
  //   "الثَّانِيَ عَشَرَ",
  //   "الثَّالِثَ عَشَرَ",
  //   "الرَّابِعَ عَشَرَ",
  //   "الخَامِسَ عَشَرَ",
  //   "السَّادِسَ عَشَرَ",
  //   "السَّابِعَ عَشَرَ",
  //   "الثَّامِنَ عَشَرَ",
  //   "التَّاسِعَ عَشَرَ",
  //   "العِشْرُونَ",
  //   "الحَادِيَ وَالعِشْرُونَ",
  //   "الثَّانِيَ وَالعِشْرُونَ",
  //   "الثَّالِثَ وَالعِشْرُونَ",
  //   "الرَّابِعَ وَالعِشْرُونَ",
  //   "الخَامِسَ وَالعِشْرُونَ",
  //   "السَّادِسَ وَالعِشْرُونَ",
  //   "السَّابِعَ وَالعِشْرُونَ",
  //   "الثَّامِنَ وَالعِشْرُونَ",
  //   "التَّاسِعَ وَالعِشْرُونَ",
  //   "الثَّلاَثُونَ",
  // ];
  const arabicNumbers = [
    "الأول",
    "الثاني",
    "الثالث",
    "الرابع",
    "الخامس",
    "السادس",
    "السابع",
    "الثامن",
    "التاسع",
    "العاشر",
    "الحادي عشر",
    "الثاني عشر",
    "الثالث عشر",
    "الرابع عشر",
    "الخامس عشر",
    "السادس عشر",
    "السابع عشر",
    "الثامن عشر",
    "التاسع عشر",
    "العشرون",
    "الحادي والعشرون",
    "الثاني والعشرون",
    "الثالث والعشرون",
    "الرابع والعشرون",
    "الخامس والعشرون",
    "السادس والعشرون",
    "السابع والعشرون",
    "الثامن والعشرون",
    "التاسع والعشرون",
    "الثلاثون",
  ];

  if (number < 1 || number > 30) {
    throw new Error("رقم غير صالح. يُرجى إدخال رقم بين 1 و 30.");
  }

  // return `الجُزْءُ ${arabicNumbers[number - 1]}`;
  return `الجزء ${arabicNumbers[number - 1]}`;
}

export { juzName };
